Repository: abeek1/61439-3_2024
Catalog: tm/EVS-EN_61439-1_2021/EVS-EN_61439-1_2021_10_Design verification  _10 KONSTRUKTSIOONIOMADUSTE KONTROLL.tmx
Source language: en
Languages: et

source: At the end of the test, the temperature-rise shall not exceed the values specified in Table 6.
et: Katsetuse lõpus ei tohi ületemperatuur olla suurem kui tabelis 6 sätestatud väärtused.

source: If tests according to 10.10.2.3.6 or 10.10.2.3.7 have been carried out to verify Inc in addition to Ing, for the outgoing circuits, then the rated diversity factor may be calculated (see 3.8.11 and 5.4).
et: Kui katsetused vastavalt jaotisele 10.10.2.3.6 või 10.10.2.3.7 on sooritatud väljundahelate voolude Inc kontrolliks lisaks voolule Ing, saab arvutada tunnus-samaaegsusteguri (vt termin 3.8.11 ja jaotis 5.4).

source: 10.10.3 Verification by comparison 10.10.3.1 General The following subclauses define how the rated currents of variants can be verified by derivation from similar arrangements verified by testing.
et: 10.10.3 Kontroll võrdlemise teel 10.10.3.1 Üldnõuded Järgmised jaotised määravad, kuidas variantide tunnusvoolusid saab kontrollida tuletamise teel samasuguste korraldusviiside järgi, mida on katsetusega kontrollitud.

source: Tests carried out at a particular frequency are applicable at the same current rating to lower frequencies including DC.
et: Katsetused, mis on sooritatud teataval konkreetsel sagedusel, on rakendatavad samal tunnusvoolul madalama sageduse, sealhulgas alalisvoolul, korral.

source: Temperature-rise tests on the circuit(s) carried out at 50 Hz are applicable to 60 Hz for rated currents up to and including 800 A.
et: Ahela(te) ületemperatuurikatsetused sagedusel 50 Hz on tunnusvoolul kuni 800 A rakendatavad ka sagedusel 60 Hz.

source: In the absence of tests at 60 Hz for currents above 800 A, the rated current at 60 Hz shall be reduced to 95 % of that at 50 Hz.
et: Kui katsetusi sagedusel 60 Hz voolude jaoks üle 800 A ei ole sooritatud, tuleb tunnusvoolu sagedusel 60 Hz vähendada väärtuseni 95 % võrreldes vooluga sagedusel 50 Hz.

source: Alternatively, where the maximum temperature-rise at 50 Hz does not exceed 90 % of the permissible value, then derating for 60 Hz is not required.
et: Alternatiivina, kui suurim ületemperatuur sageduse 50 Hz puhul ei ole üle 90 % lubatavast väärtusest, ei ole sageduse 60 Hz puhul tunnusvoolu vähendamine nõutav.

source: 10.10.3.2 Assemblies
et: 10.10.3.2 Koosted

source: Assemblies verified by derivation from a similar tested arrangement shall comply with the following:
et: Koosted, mida on kontrollitud tuletamise teel samasuguse katsetatud korraldusviisiga koostete järgi, peavad vastama järgmistele nõuetele:

source: a) the functional units shall belong to the same group(s) as the functional unit(s) selected for test (see 10.10.2.2.3);
et: a) funktsionaalühikute kuuluvus sama(de)sse rühma(desse) nagu katsetusteks valitud funktsionaalühik(ud) (vt jaotis 10.10.2.2.3);

source: b) the same type of construction as used for the test;
et: b) samasugune konstruktsiooni liik nagu katsetuseks kasutatud;

source: c) the same or increased overall dimensions as used for the test;
et: c) samad või suuremad üldmõõtmed nagu katsetuseks kasutatud;

source: d) the same or increased cooling conditions as used for the test (forced or natural convection, same or larger ventilation openings);
et: d) samad või paremad jahutusolud nagu katsetuseks kasutatud (sund- või loomulik konvektsioon, samad või suuremad ventilatsiooniavad);

source: e) the same or reduced internal separation as used for the test (if any);
et: e) samade või väiksemate mõõtmetega sisemine eraldamine (kui see on olemas) nagu katsetuseks kasutatud;

source: f) the same or reduced power losses in the same section as used for the test.
et: f) samas sektsioonis samad või väiksemad võimsuskaod nagu katsetuseks kasutatud.

source: The assembly being verified may comprise all or only part of the electrical circuits of the assembly previously verified.
et: Kontrollitavas koostes võivad olla kas kõik või ainult osa varem kontrollitud kooste elektriahelatest.

source: Alternative arrangement(s) of functional units within the assembly or section compared to the tested variant is allowed as long as the thermal influences of the adjacent units are not more severe.
et: Funktsionaalühikute kooste- või sektsioonisisene alternatiivne korraldusviis (või alternatiivsed korraldusviisid) võrreldes katsetatud variandiga on lubatud tingimusel, et külgnevate ühikute soojuslikud toimed ei ole raskemad.

source: Thermal tests performed on 3-phase, 3-wire assemblies are considered as representing 3phase, 4-wire and single-phase, 2-wire or 3-wire assemblies, provided that the neutral conductor is sized equal to or greater than the line conductors and arranged in the same manner.
et: Kolmefaasiliste kolmejuhiliste koostete soojuslikke katsetusi loetakse esinduslikuks ka kolmefaasiliste neljajuhiliste ja ühefaasiliste kahe- või kolmejuhiliste koostete korral, kui on tagatud, et neutraaljuhi ristlõige on sama suur või suurem kui samal viisil paigutatud faasijuhtidel.

source: 10.10.3.3 Busbars Ratings established for aluminium busbars are valid for copper busbars with the same crosssectional dimensions and configuration.
et: 10.10.3.3 Kogumislatid Alumiiniumlattidele kehtestatud tunnusandmed kehtivad ka sama ristlõike ja sama konfiguratsiooniga vasklattide puhul.

source: However, ratings established for copper busbars shall not be used to establish ratings of aluminium busbars.
et: Vasklattide tunnusandmeid aga ei tohi kasutada alumiiniumlattide tunnusväärtuste kehtestamiseks.

source: The ratings of variants not selected for test according to 10.10.2.2.2 shall be determined by multiplying their cross-section with the current density of a larger cross-section busbar of the same design that has been verified by testing.
et: Nende variantide tunnusandmed, mida vastavalt jaotisele 10.10.2.2.2 ei valitud katsetusteks, tuleb määrata nende ristlõike ja sama konstruktsiooniga katsetustel kontrollitud suurima ristlõikega lati voolutiheduse korrutisena.

source: If, additionally, a smaller cross-section than the one to be derived has been tested, which also fulfils the conditions of 10.10.2.2.2, then the rating of the intermediate variants may be established by interpolation.
et: Kui peale ülaltoodud viisil kavandatava lati on katsetatud ka väiksema ristlõikega latti, mis samuti rahuldab jaotise 10.10.2.2.2 tingimusi, saab vahepealsete variantide tunnusandmed määrata interpoleerimise teel.

source: Modification of the connection between main and distribution busbar is permissible if the modification is verified by a test in which the temperature-rise in the new arrangement is not higher than in a comparable test on the reference design.
et: Pea- ja jaotuslattide ühenduse muutmine on lubatav, kui muudatus on kontrollitud katsetamise teel, milles ületemperatuur uue korraldusviisi puhul ei ole kõrgem kui etalonkonstruktsiooni võrreldaval katsetusel.

source: 10.10.3.4 Functional units After the critical variant of each group of comparable functional units (see 10.10.2.2.3 a)) has been subjected to a test for verification of temperature-rise, the actual rated currents Ing, and if determined, Inc, of all other functional units in the group shall be calculated using the results of these tests.
et: 10.10.3.4 Funktsionaalühikud Pärast seda kui iga funktsionaalühikute komplekti võrreldav kriitiline variant (vt jaotise 10.10.2.2.3 punkt a) on ületemperatuuri piirväärtuste kontrollimiseks katsetatud, tuleb nende katsetuste tulemusi kasutades arvutada tegelikud tunnusvoolud Ing ja, kui määratud, voolud Inc komplekti kõigi teiste funktsionaalühikute jaoks.

source: For each functional unit tested, a de-rating factor (rated current, Inc or Ing, resulting from the test divided by the maximum possible current of this functional unit, see 10.10.2.2.3 b)) shall be calculated.
et: Iga katsetatud funktsionaalühiku jaoks tuleb arvutada tunnusandmete vähendustegur (katsetustest leitud tunnusvool Inc või Ing jagatuna selle funktsionaalühiku suurima võimaliku vooluga (vt jaotise 10.10.2.2.3 punkt b).

source: The rated current, Inc or Ing, of each non-tested functional unit in the range shall be the maximum possible current of the functional unit multiplied by the de-rating factor established for the variant tested in the range.
et: Iga mittekatsetatud funktsionaalühiku tunnusvool Inc või Ing antud vahemikus peab võrduma funktsionaalühiku suurima võimaliku vooluga, mis on korrutatud selles vahemikus katsetatud variandile kehtestatud tunnusandmete vähendusteguriga.

source: Modification of the connection between functional unit and the main or distribution busbar is permissible if the modification is verified by a test in which the temperature-rise in the new arrangement is not higher than in a comparable test on the reference design.
et: Funktsionaalühiku ja pea- või jaotuslattide ühenduse muutmine on lubatav, kui muudatus on kontrollitud katsetamise teel, milles ületemperatuur uue korraldusviisi puhul ei ole kõrgem kui etalonkonstruktsiooni võrreldaval katsetusel.

source: 10.10.3.5 Functional units – Temperature-rise considerations for device substitution A device with a rated current In not exceeding 1 600 A may be substituted with a similar device from another series from the same or a different device manufacturer to that used in the original verification, provided that the power loss and terminal temperature-rise of the substituting device is the same as or lower than the device used in the original verification, when both are tested in accordance with the devices' product standard.
et: 10.10.3.5 Funktsionaalühikud – ületemperatuuri arvestamine seadiste asendamisel Seadist, mille tunnusvool In ei ole üle 1600 A, võib asendada samasuguse muu sarja originaalkontrollil kasutatud seadisega kas samalt või muult tootjalt, kui on tagatud, et asendusseadise võimsuskadu ja klemmide ületemperatuur on sama või väiksem kui originaalkontrollil kasutatud seadisel, kui mõlemad on katsetatud seadiste tootestandardi järgi.

source: Alternatively, and without a limit on current rating, when the original device and the substituting device are from the same device manufacturer, the device manufacturer may issue a declaration of temperature-rise performance.
et: Alternatiivselt ja ilma tunnusvoolu piiramiseta, kui originaalseadis ja asendusseadis pärinevad ühelt ja samalt seadisetootjalt, võib seadisetootja anda välja deklaratsiooni ületemperatuuri toimivuse kohta.

source: The declaration shall confirm that the substituting device can replace the original device with no further need for verification in respect of temperature-rise.
et: Deklaratsioon peab kinnitama, et asendusseadis võib asendada originaalseadist ilma ületemperatuuri edasise kontrolli vajaduseta.

source: The declaration shall include statements indicating that the power loss for the substituting device is the same or lower than the original device.
et: Deklaratsioon peab sisaldama lausungit, mis näitab, et asendusseadise võimsuskadu on sama või väiksem kui originaalseadisel.

source: In addition, for both the above options the physical arrangement within the functional unit shall be maintained.
et: Lisaks mõlemale eelnimetatud variandile tuleb säilitada funktsionaalühiku sisemine füüsikaline korraldusviis.

source: The rating of a functional unit shall not be increased.
et: Funktsionaalühiku tunnusandmed ei tohi suureneda.

source: The physical arrangements shall include terminal shields, conductor type, material, and connection sizes, mounting orientation, clearances to other parts, ventilation arrangements and terminal arrangement.
et: Füüsikaline korraldusviis peab hõlmama klemmikatteid, juhtide liiki, materjali ja ühendusmõõtmeid, monteerimisorientatsiooni, õhkvahemikke muude osadeni, ventilatsioonikorraldust ja klemmide korraldust.

source: The performance data on terminal temperatures and power loss may be obtained from the device manufacturer or from comparison tests undertaken by those responsible for the substitution.
et: Klemmide temperatuuri ja võimsuskao toimivusandmed võidakse saada seadise tootjalt või võrdluskatsetuse teel asenduse eest vastutajate ettevõtmisel.

source: Any test shall be conducted on new samples.
et: Kõik katsetused peavad toimuma uute näidistega.

source: Refer to Table D.1 for other design characteristics, including short-circuit withstand (see Table 13, Item 6), that require consideration when substituting devices.
et: Tabelis D.1 on esitatud muud konstruktsiooniandmed, sealhulgas vastupidavus lühisvoolule (vt tabeli 13 punkt 6), mida tuleb seadiste asendamisel arvestada.

source: 10.10.3.6 Calculation of currents based on adjustment of ambient air temperature Once a temperature-rise test has been carried out applying the temperature-rise limits for a daily average ambient air temperature of 35 °C, the rated currents confirmed by testing for a daily average ambient air temperature of 35 °C can be adjusted by calculation to determine rated current for daily average ambient air temperatures between 20 °C and 50 °C, assuming that the temperature-rise of each component or device is proportional to the power loss generated in this component.
et: 10.10.3.6 Voolu arvutamine ümbruse õhutemperatuuriga kohandamise alusel Kui ületemperatuurikatsetus on sooritatud ületemperatuuri piiride rakendamisel vastavalt keskmisele ööpäevasele ümbritseva õhu temperatuurile 35 °C, võib tunnusvoolusid, mis on kinnitatud katsetamisel keskmise ööpäevase ümbritseva õhu temperatuuri 35 °C korral, täpsustada tunnusvoolu arvutamise teel keskmise ööpäevase ümbritseva õhu temperatuuri korral 20 °C ja 50 °C vahel, eeldades, et iga komponendi või seadise ületemperatuur on võrdeline selles komponendis tekkiva võimsuskaoga.

source: Caution should be taken to ensure the devices being assessed have a power loss substantially proportional to I2 and not applied to devices that have substantially fixed or linear losses.
et: On vaja tagada, et arvestatavate seadiste võimsuskadu on sisuliselt võrdeline voolu ruuduga I2 ja ei kehti seadiste kohta, mille võimsuskadu on sisuliselt konstantne või lineaarne.

source: By agreement between the user and the manufacturer, in assemblies where the power loss of conductors and devices is substantially proportional to I2, the rated current of the circuits at ambient air temperatures (outside the enclosure) between 20 °C and 50 °C may be calculated using the following formula:
et: Kasutaja ja tootja kokkuleppe alusel võib koostetes, mille juhtide ja seadiste võimsuskadu on sisuliselt võrdeline voolu ruuduga I2, eeldada, et saab arvutada ahelate tunnusvoolu ümbruse õhutemperatuuri korral (väljaspool ümbrist) 20 °C ja 50 °C vahel, kasutades valemit 22:1996, valem nr 8] MÄRKUS Temperatuuri täpsustuse piiratud vahemiku arvestamisel kehtib valem ka alumiiniumjuhtide puhul.

source: I1 is the current at which the temperature-rise test is carried out;
et: I1 on vool, mille juures ületemperatuurikatsetus on sooritatud;

source: T1 is the temperature-rise measured by test with a current of I1;
et: ∆T1 on ületemperatuur, mis on mõõdetud voolu I1 puhul;

source: T2 is maximum permissible temperature-rise at the specific ambient air temperature between 20 °C and 50 °C.
et: ∆T2 on enimalt lubatav ületemperatuur ümbritseva õhu iseloomulikul temperatuuril 20 °C ja 50 °C vahel.

source: I2 cannot exceed the rated current of any device, (e.g. In for a circuit-breaker), within the circuit being considered, e.g. a circuit including a 1 600 A circuit-breaker cannot be assigned a current rating of 1 750 A in an ambient air temperature of 20 °C.
et: Vool I2 ei või arvestatavas ahelas olla suurem kui tunnusvool mingis seadises (nt kaitselüliti vool In); nt ahelat, mis sisaldab kaitselülitit vooluga 1600 A, ei või arvestada tunnusvoolule 1750 A ümbritseva õhu temperatuuril 20 °C.

source: 10.10.4 Verification assessment 10.10.4.1 General The following calculation methods are provided, which have differing ranges of applicability: 1) single compartment assembly with natural cooling and rated current InA not exceeding 630 A (10.10.4.2); 2) assembly with natural cooling and rated current InA not exceeding 1 600 A (10.10.4.3).
et: 10.10.4 Kontrollhindamine 10.10.4.1 Üldnõuded On ette nähtud kaks alljärgnevat erisuguse rakendatavusega arvutumeetodit: 1) ühesektsiooniline loomuliku jahutusega kooste, mille tunnusvool InA ei ole üle 630 A (jaotis 10.10.4.2); 2) loomuliku jahutusega kooste, mille tunnusvool InA ei ole üle 1600 A (jaotis 10.10.4.3).

source: These methods determine the approximate air temperature-rise inside the enclosure, which is caused by the power losses of all circuits, and compares this temperature with the limits for the installed equipment.
et: Need meetodid määravad ümbrisesisese õhu ligikaudse ületemperatuuri, mis on põhjustatud kõigi ahelate võimsuskadudest, ja võrdlevad seda temperatuuri paigaldatud seadmetele kehtestatud piirväärtustega.

source: The methods differ only in the way the relationship between the delivered power loss and the air temperature-rise inside the enclosure is ascertained.
et: Meetodid erinevad teineteisest vaid selle poolest, kuidas võimsuskadu ja ümbrisesisese õhu ületemperatuur kindlaks tehakse.

source: Due to the actual local temperatures of the current-carrying parts, which cannot be calculated by these methods, some limits and safety margins are necessary and included.
et: Voolujuhtivate osade temperatuuri tegelike lokaalsete väärtuste tõttu, mida nende meetoditega arvutada ei saa, on vajalikud ja ka arvesse võetud teatud piirangud ning ohutusvaru.

source: Verification of the temperature-rise may be made by calculation if all the following general conditions and the additional conditions for the selected calculation method are fulfilled.
et: Ületemperatuuri kontrolli võib sooritada arvutusega, kui kõik alljärgnevad üld- ja lisatingimused on valitud arvutusmeetodi puhul täidetud.

source: a) The rated frequency is up to and including 60 Hz.
et: a) Tunnussagedus on kuni 60 Hz.

source: b) The power loss data for all built-in electrical components is available from the component manufacturer.
et: b) Kõigi sisseehitatud elektriliste komponentide võimsuskao andmed on komponentide tootjalt kättesaadavad.

source: c) There is an approximately even distribution of power losses inside the enclosure.
et: c) Võimsuskaod seespool ümbrist on ligikaudu ühtlase jaotusega.

source: d) The mechanical parts and the installed equipment are so arranged that air circulation is not significantly impeded.
et: d) Mehaanilised osad ja paigaldatud seadmed on selliselt korraldatud, et õhu ringlus ei ole tunduval määral takistatud.

source: e) The group rated current of the circuits, (Ing), of the assembly to be verified shall not exceed 80 % of the rated conventional free air thermal current (Ith) if known, or when Ith is not available, 80 % of the rated current (In) of the switching devices and electrical components included in the circuit.
et: e) Kooste ahelate kontrollimisele kuuluv rühmtunnusvool (Ing) ei tohi olla üle 80 % tinglikust soojuslikust vabaõhu-tunnusvoolust (Ith), kui see on teada, või, kui Ith ei ole kättesaadav, 80 % ahelas sisalduvate lülitusaparaatide ja elektriliste komponentide tunnusvoolust (In).

source: Circuit-protection devices shall be selected to ensure adequate protection to outgoing circuits, e.g. thermal motor protection devices at the calculated temperature in the assembly.
et: Lülitusaparaadid tuleb valida tagamaks väljundahelate piisava kaitse, nt mootorite termilised kaitseseadised arvutatud temperatuuril kooste sees.

source: The limitation to 80 % of the rated current Ith or In does not apply to electronic devices which incorporate means for forced ventilation when they are installed according to the device manufacturer’s instructions.
et: Tunnusvoolu Ith või In piiramist tasemeni 80 % ei rakendata elektroonikaseadistele, mis sisaldavad tugevdatud ventilatsiooni vahendeid, kui need on paigaldatud seadiste tootja juhendite kohaselt.

source: NOTE 1 There is no common characteristic for switching devices and electrical components that describes the value of current to be used here.
et: MÄRKUS 1 Lülitusaparaatide ja elektriliste komponentide jaoks ei ole üldist tunnust, mis kirjeldab voolu siin kasutatud väärtust.

source: For the purpose of verifying the temperature-rise limits, the value of the current is used, which describes the maximum continuous operational current that can be carried without overheating.
et: Ületemperatuuri piirväärtuste kontrolli eesmärgil võib kasutada voolu väärtust, mis kirjeldab suurimat kestevtalitlusvoolu, mida võidakse kanda ilma ülekuumenemiseta.

source: This is, for example, for contactors the rated operational current Ie AC1 and for circuit-breakers the rated current In.
et: Kontaktorite jaoks on see näiteks tunnus-talitlusvool Ie talitlusviisil AC1 ja kaitselülitite jaoks tunnusvool In.

source: NOTE 2 This verification method assesses the mean air temperature inside the enclosure assuming an even distribution of the power losses.
et: MÄRKUS 2 See kontrollimeetod hindab õhu keskmist temperatuuri ümbrise sees, eeldades võimsuskadude ühtlast jaotust.

source: Therefore, potential local hot spots at the devices, which are the main power loss sources, cannot be detected.
et: Seetõttu ei saa avastada seadiste võimalikke lokaalseid kuumi punkte, mis on võimsuskao peamised allikad.

source: To prevent overheating of the devices, the safety margin of 80 % is introduced.
et: Et vältida seadiste ülekuumenemist, on võetud kasutusele ohutuspiir 80 %.

source: This is based on general testing experience.
et: See põhineb üldisel katsetuskogemusel.

source: NOTE 3 Electronic devices with forced ventilation distribute their power losses mainly via the cooling air.
et: MÄRKUS 3 Tugevdatud ventilatsiooniga elektroonikaseadised eraldavad oma võimsuskadusid peaasjalikult jahutusõhu kaudu.

source: They do not rely on the power dissipation via the conductors and the surface of the device/enclosure.
et: Need ei tugine võimsuse hajutamisel juhtide ja seadiste või ümbrise pinna kaudu.

source: Usually they are equipped with internal temperature monitoring to prevent overheating.
et: Ülekuumenemise vältimiseks on need tavaliselt varustatud sisemise temperatuuriseirega.

source: Therefore, a limitation to 80 % of the rated current as imposed for other devices is not appropriate.
et: Seetõttu ei ole voolu vähendamine väärtuseni 80 % tunnusvoolust, nagu seda rakendatakse muude seadiste puhul, asjakohane.

source: f) All conductors directly connected to a device shall have a minimum cross-sectional area based on 125 % of the group rated current, Ing, of the associated circuit.
et: f) Kõigi otseselt seadisega ühendatud juhtide vähim ristlõige peab põhinema sellekohase ahela rühmtunnusvoolu Ing 125-protsendilisel väärtusel.

source: Selection of cables shall be in accordance with IEC 60364-5-52:2009.
et: Juhtmete ja kaablite valik peab toimuma standardi IEC 60364-5-52:2009 järgi.

source: Examples of how to adapt this document for conditions inside an assembly are given in Annex H.
et: Näited selle kohta, kuidas kohandada seda dokumenti koostesisestele oludele, on esitatud lisas H.

source: The cross-section of bare copper bars shall be as tested or as given in Annex K.
et: Paljaste vasklattide ristlõige peab olema nagu katsetatud või nagu esitatud lisas K.

source: Where the device manufacturer specifies a conductor with a larger cross-sectional area, this shall be used.
et: Kui seadise tootja sätestab suurema ristlõikega juhi, tuleb seda kasutada.

source: NOTE 4 The factor of 125 % is used to ensure that the conductors will not further derate the devices.
et: MÄRKUS 4 Tegurit 125 % kasutatakse tagamaks, et juhid ei põhjustaks seadiste koormuse edasist vähendamist.
